Урок 1. Контрольная работа
СДАВАТЬ ССЫЛКОЙ НА GITHUB
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Мы находимся сейчас в README.md.
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
using System;

Решение
Вы находитесь в созданном репозитории (https://github.com/iSereban/Tests.git).
Блок-схема алгоритма: представлена в файле diagram_tests.png
4. Решение задачи:
Создание и заполнение массива строк
Вызов функции для формирования нового массива
Вывод исходного массива и результата
Функция для фильтрации строк по длине
Подсчет количества строк, удовлетворяющих условию
Создание нового массива
Заполнение нового массива
class Test
{
    static void Main()
    {
        Console.WriteLine("Введите количество слов");
        int count = Convert.ToInt32(Console.ReadLine());

        string[] arrayString = new string[count];
        for (int i = 0; i < count; i++)
        {
            Console.WriteLine("Введите слово");
            arrayString[i] = Console.ReadLine();

        }

        string[] resultArray = FilterStringsByLength(arrayString, 3);

        Console.WriteLine($"[{string.Join(", ", arrayString)}] -> [{string.Join(", ", resultArray)}]");
    }

    static string[] FilterStringsByLength(string[] array, int maxLength)
    {
        int count = 0;
        foreach (string str in array)
        {
            if (str.Length <= maxLength)
            {
                count++;
            }
        }

        string[] result = new string[count];
        int index = 0;

        foreach (string str in array)
        {
            if (str.Length <= maxLength)
            {
                result[index] = str;
                index++;
            }
        }

        return result;
    }
}

5. Использовать контроль версий в работе - использовано много раз.